# Задание 1

In [1]:
import pandas as pd
import numpy as np

author_id, author_name = [1, 2, 3], ['Тургенев', 'Чехов', 'Островский']

authors = pd.DataFrame(list(zip(author_id, author_name)))
authors

   0           1
0  1    Тургенев
1  2       Чехов
2  3  Островский

In [2]:
author_id, book_title, price = [1, 1, 1, 2, 2, 3, 3],\
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],\
[450, 300, 350, 500, 450, 370, 290]
data = list(zip(author_id, book_title, price))

book = pd.DataFrame(data)

book

   0                     1    2
0  1           Отцы и дети  450
1  1                 Рудин  300
2  1     Дворянское гнездо  350
3  2      Толстый и тонкий  500
4  2       Дама с собачкой  450
5  3                 Гроза  370
6  3  Таланты и поклонники  290

# Задание 2

In [3]:
author_price = pd.merge(authors, book, on=0)
author_price

   0         1_x                   1_y    2
0  1    Тургенев           Отцы и дети  450
1  1    Тургенев                 Рудин  300
2  1    Тургенев     Дворянское гнездо  350
3  2       Чехов      Толстый и тонкий  500
4  2       Чехов       Дама с собачкой  450
5  3  Островский                 Гроза  370
6  3  Островский  Таланты и поклонники  290

# Задание 3

In [4]:
top5 = author_price.sort_values(by=2, 
                                ascending=False)[:-2]
top5

   0         1_x                1_y    2
3  2       Чехов   Толстый и тонкий  500
0  1    Тургенев        Отцы и дети  450
4  2       Чехов    Дама с собачкой  450
5  3  Островский              Гроза  370
2  1    Тургенев  Дворянское гнездо  350

# Задание 4

In [5]:
group = author_price.groupby('1_x')
data = [i[0] for i in group]
author_stat = pd.DataFrame({'author_name': [i for i in data], 
                           'min_price': [i for i in group[2].min()],
                           'max_price': [i for i in group[2].max()],
                           'mean_price': [i for i in group[2].mean()],
                           })
author_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

# Задание 5*

In [6]:
author_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
author_price

   0         1_x                   1_y    2    cover
0  1    Тургенев           Отцы и дети  450  твердая
1  1    Тургенев                 Рудин  300   мягкая
2  1    Тургенев     Дворянское гнездо  350   мягкая
3  2       Чехов      Толстый и тонкий  500  твердая
4  2       Чехов       Дама с собачкой  450  твердая
5  3  Островский                 Гроза  370   мягкая
6  3  Островский  Таланты и поклонники  290   мягкая

In [7]:
pd.pivot_table?

In [8]:
table = pd.pivot_table(author_price, 
                       index=['1_x'], 
                       columns='cover', 
                       values=2, 
                       aggfunc=np.sum)
table.index.name = None
table.columns.name = None
book_info = table.fillna(0)
book_info

            мягкая  твердая
Островский   660.0      0.0
Тургенев     650.0    450.0
Чехов          0.0    950.0

In [9]:
book_info.to_pickle('book_info.pkl')

In [10]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

            мягкая  твердая
Островский   660.0      0.0
Тургенев     650.0    450.0
Чехов          0.0    950.0

In [11]:

book_info.equals(book_info2)

True